<template>
    <div class="container">
        <div class="title">最终用户许可协议</div>
        <div class="main">
            <h1>忒特最终用户许可协议</h1>
            <p>
                欢迎使用忒特社交网站（以下简称“本平台”）。在注册账号并使用本平台之前，请您仔细阅读本最终用户许可协议（以下简称“协议”）的所有条款和条件。通过点击同意或继续使用本平台，即表示您已理解、接受并同意遵守本协议。
            </p>
            <h2>1. 账号注册与管理</h2>
            <p>
                1.1
                您需自行创建一个唯一且有效的账号，并确保所提供的个人信息真实、准确、完整和及时更新。
            </p>
            <p>
                1.2
                您对登录账号和密码的安全负有责任，不得将其转让、出租、借用给他人使用。如发现任何未经授权使用您账号的情况，应立即通知我们。
            </p>
            <h2>2. 用户行为规范</h2>
            <p>2.1 在使用本平台期间，您承诺：</p>
            <ul>
                <li>2.1.1 遵守当地法律法规以及本平台制定的各项规则；</li>
                <li>
                    2.1.2 不发布、传播涉及色情、暴力、诽谤、侵权等违法信息；
                </li>
                <li>
                    2.1.3
                    尊重其他用户的合法权益，不进行骚扰、威胁或恶意攻击行为；
                </li>
                <li>2.1.4 不从事任何损害本平台正常运营和稳定性的活动。</li>
            </ul>
            <h2>3. 广告与推广</h2>
            <p>
                3.1
                在本平台上存在第三方广告和推广内容。您理解并同意，这些广告和推广内容由相应广告商提供，我们对其真实性、准确性和合法性不负责任。
            </p>
            <p>
                3.2
                您在使用本平台过程中可能会收到来自我们或合作伙伴的推广信息，您可以选择接受或拒绝。如您选择拒绝接收，请联系客服取消相关服务。
            </p>
            <h2>4. 隐私保护</h2>
            <p>
                4.1
                我们将根据法律法规和隐私政策保护您的个人隐私信息，并采取合理措施防止其泄露、篡改或丢失。
            </p>
            <p>
                4.2
                您同意我们收集、存储和使用您的个人信息，用于提供本平台的相关服务，并可能向您发送与之相关的通知。
            </p>
            <h2>5. 免责声明</h2>
            <p>
                5.1
                您理解并同意，在使用本平台过程中可能会遇到不可抗力因素导致的服务中断、故障或数据丢失等情况。对此我们将尽力进行修复，但不承担任何赔偿责任。
            </p>
            <p>
                5.2
                您在本平台上发布的内容均由您自行负责，我们不对其合法性、真实性、准确性和完整性负责。
            </p>
            <h2>6. 协议变更与终止</h2>
            <p>
                6.1
                我们有权根据需要修改本协议，并通过适当方式通知您。如您继续使用本平台，则视为您接受修改后的协议。
            </p>
            <p>
                6.2
                如发生违反本协议的行为，我们有权立即暂停或终止您的账号使用权限，同时保留进一步追究法律责任的权利。
            </p>
            <h2>7. 法律适用与争议解决</h2>
            <p>7.1 本协议的解释、执行和争议解决应适用中国法律。</p>
            <p>
                7.2
                如发生与本协议相关的争议，双方应通过友好协商解决；协商不成时，您同意将争议提交至有管辖权的法院解决。
            </p>
            <p>
                请您在注册账号前仔细阅读以上条款和条件。如有任何疑问，请联系我们的客服团队。
            </p>
        </div>
    </div>
</template>

<script lang="ts">
    export default {
        name: "",
    };
</script>
<script setup lang="ts"></script>

<style scoped lang="less">
    .container {
        flex: 605;
        overflow-y: scroll;
        .title {
            z-index: 2;
            position: fixed;
            top: 0;
            // left: 8.3vmax;
            height: 5vmax;
            // width: 59.3vmax;
            width: 100%;
            font-weight: bold;
            font-size: 2vmax;
            line-height: 5vmax;
            user-select: none;
            text-indent: 2vmax;
            backdrop-filter: blur(30px);
            background-color: rgba(255, 255, 255, 0.8);
        }
        .main {
            padding: 5vmax 0;
            font-size: 1.2vmax;
            color: var(--text-main);
            text-indent: 2vmax;
        }
    }
</style>
